loadtest/jmeter/gentrip-async-plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="GenTrip async plan load test" enabled="true">
      <stringProp name="TestPlan.comments">Measures 202 acceptance separately from end-to-end completion through status polling.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Async plan users" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${__P(loops,-1)}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(users,1)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(ramp,10)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(duration,600)}</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Plan queries" enabled="true">
          <stringProp name="filename">${__P(queries,loadtest/jmeter/queries.csv)}</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">true</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="JSON headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">${__groovy(def token = System.getenv('GENTRIP_JWT'); token ? 'Bearer ' + token : '')}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="E2E plan completion" enabled="true">
          <boolProp name="TransactionController.parent">true</boolProp>
          <boolProp name="TransactionController.includeTimers">true</boolProp>
        </TransactionController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Submit plan - acceptance" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&quot;query&quot;:&quot;${__groovy(org.apache.commons.text.StringEscapeUtils.escapeJson(vars.get('query')))}&quot;,&quot;tenant_id&quot;:&quot;${tenant_id}&quot;,&quot;user_id&quot;:&quot;${user_id}&quot;,&quot;idempotency_key&quot;:&quot;${idempotency_key}&quot;}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">${__P(host,127.0.0.1)}</stringProp>
            <stringProp name="HTTPSampler.port">${__P(port,8080)}</stringProp>
            <stringProp name="HTTPSampler.protocol">${__P(protocol,http)}</stringProp>
            <stringProp name="HTTPSampler.path">/api/v1/routes/plan/runs</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
            <stringProp name="HTTPSampler.response_timeout">10000</stringProp>
          </HTTPSamplerProxy>
          <hashTree>
            <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Initialize iteration" enabled="true">
              <stringProp name="scriptLanguage">groovy</stringProp>
              <stringProp name="script">def prefix = props.get('tenant_prefix') ?: 'jmeter'
def threadId = ctx.getThreadNum() + 1
def authenticatedTenant = System.getenv('GENTRIP_TENANT_ID')
vars.put('tenant_id', authenticatedTenant ?: "${prefix}-${threadId}")
vars.put('user_id', "load-user-${threadId}")
vars.put('idempotency_key', UUID.randomUUID().toString())
vars.put('run_id', '')
vars.put('run_status', 'queued')
vars.put('poll_count', '0')</stringProp>
            </JSR223PreProcessor>
            <hashTree/>
            <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract run id" enabled="true">
              <stringProp name="JSONPostProcessor.referenceNames">run_id</stringProp>
              <stringProp name="JSONPostProcessor.jsonPathExprs">$.run_id</stringProp>
              <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            </JSONPostProcessor>
            <hashTree/>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Submission accepted" enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="202">202</stringProp>
              </collectionProp>
              <stringProp name="Assertion.custom_message">Expected HTTP 202 from async submission</stringProp>
              <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">8</intProp>
            </ResponseAssertion>
            <hashTree/>
          </hashTree>
          <IfController guiclass="IfControllerPanel" testclass="IfController" testname="Submission produced run id" enabled="true">
            <stringProp name="IfController.condition">${__groovy(vars.get('run_id') != null &amp;&amp; !vars.get('run_id').isEmpty())}</stringProp>
            <boolProp name="IfController.evaluateAll">false</boolProp>
            <boolProp name="IfController.useExpression">true</boolProp>
          </IfController>
          <hashTree>
            <WhileController guiclass="WhileControllerGui" testclass="WhileController" testname="Poll until terminal" enabled="true">
              <stringProp name="WhileController.condition">${__groovy(!(vars.get('run_status') ==~ /completed|degraded|failed|cancelled|timed_out|interrupted/) &amp;&amp; ((vars.get('poll_count') ?: '0') as int) &lt; ((props.get('max_polls') ?: '900') as int))}</stringProp>
            </WhileController>
            <hashTree>
              <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Polling interval" enabled="true">
                <stringProp name="ConstantTimer.delay">${__P(poll_ms,500)}</stringProp>
              </ConstantTimer>
              <hashTree/>
              <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Poll plan status" enabled="true">
                <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                  <collectionProp name="Arguments.arguments">
                    <elementProp name="tenant_id" elementType="HTTPArgument">
                      <boolProp name="HTTPArgument.always_encode">true</boolProp>
                      <stringProp name="Argument.name">tenant_id</stringProp>
                      <stringProp name="Argument.value">${tenant_id}</stringProp>
                      <stringProp name="Argument.metadata">=</stringProp>
                    </elementProp>
                  </collectionProp>
                </elementProp>
                <stringProp name="HTTPSampler.domain">${__P(host,127.0.0.1)}</stringProp>
                <stringProp name="HTTPSampler.port">${__P(port,8080)}</stringProp>
                <stringProp name="HTTPSampler.protocol">${__P(protocol,http)}</stringProp>
                <stringProp name="HTTPSampler.path">/api/v1/routes/plan/runs/${run_id}</stringProp>
                <stringProp name="HTTPSampler.method">GET</stringProp>
                <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
                <stringProp name="HTTPSampler.response_timeout">10000</stringProp>
              </HTTPSamplerProxy>
              <hashTree>
                <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract run status" enabled="true">
                  <stringProp name="JSONPostProcessor.referenceNames">run_status</stringProp>
                  <stringProp name="JSONPostProcessor.jsonPathExprs">$.status</stringProp>
                  <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
                  <stringProp name="JSONPostProcessor.defaultValues">poll_response_invalid</stringProp>
                </JSONPostProcessor>
                <hashTree/>
                <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Count poll" enabled="true">
                  <stringProp name="scriptLanguage">groovy</stringProp>
                  <stringProp name="script">vars.put('poll_count', (((vars.get('poll_count') ?: '0') as int) + 1).toString())</stringProp>
                </JSR223PostProcessor>
                <hashTree/>
              </hashTree>
            </hashTree>
          </hashTree>
          <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Assert successful terminal status" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script">def status = vars.get('run_status')
def ok = ['completed', 'degraded'].contains(status)
SampleResult.setResponseCode(ok ? '200' : '500')
SampleResult.setResponseMessage("terminal_status=${status}; polls=${vars.get('poll_count')}")
SampleResult.setResponseData("run_id=${vars.get('run_id')}; status=${status}", 'UTF-8')
SampleResult.setSuccessful(ok)</stringProp>
          </JSR223Sampler>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>